In [4]:
import pandas as pd
d=[1,2,3]
s1=pd.Series(d)
s1

0    1
1    2
2    3
dtype: int64

In [4]:
s2=pd.Series(["hello","world"])
s2

0    hello
1    world
dtype: object

In [15]:
df={"one":pd.Series([1,2,7]),"two":pd.Series([10,2,7])}

In [16]:
df1=pd.DataFrame(df)
df1

   one  two
0    1   10
1    2    2
2    7    7

In [9]:
d=pd.read_csv('biostats.csv')

In [28]:
d

    Name         Sex   Age   Height (in)   Weight (lbs)
0   Alex         "M"    41            74            170
1   Bert         "M"    42            68            166
2   Carl         "M"    32            70            155
3   Dave         "M"    39            72            167
4   Elly         "F"    30            66            124
5   Fran         "F"    33            66            115
6   Gwen         "F"    26            64            121
7   Hank         "M"    30            71            158
8   Ivan         "M"    53            72            175
9   Jake         "M"    32            69            143
10  Kate         "F"    47            69            139
11  Luke         "M"    34            72            163
12  Myra         "F"    23            62             98
13  Neil         "M"    36            75            160
14  Omar         "M"    38            70            145
15  Page         "F"    31            67            135
16  Quin         "M"    29            71            176
17  Ruth         "F"    28            65            131

In [30]:
d.columns

Index(['Name', '     Sex', ' Age', ' Height (in)', ' Weight (lbs)'], dtype='object')

In [31]:
type(d)

pandas.core.frame.DataFrame

In [32]:
d.size

90

In [33]:
d.shape

(18, 5)

In [34]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           18 non-null     object
 1        Sex       18 non-null     object
 2    Age           18 non-null     int64
 3    Height (in)   18 non-null     int64
 4    Weight (lbs)  18 non-null     int64
dtypes: int64(3), object(2)
memory usage: 848.0+ bytes

In [35]:
d.isnull()

     Name       Sex    Age   Height (in)   Weight (lbs)
0   False     False  False         False          False
1   False     False  False         False          False
2   False     False  False         False          False
3   False     False  False         False          False
4   False     False  False         False          False
5   False     False  False         False          False
6   False     False  False         False          False
7   False     False  False         False          False
8   False     False  False         False          False
9   False     False  False         False          False
10  False     False  False         False          False
11  False     False  False         False          False
12  False     False  False         False          False
13  False     False  False         False          False
14  False     False  False         False          False
15  False     False  False         False          False
16  False     False  False         False          False
17  False     False  False         False          False

In [36]:
d.isnull().sum()

Name             0
     Sex         0
 Age             0
 Height (in)     0
 Weight (lbs)    0
dtype: int64

In [37]:
d.head()

   Name         Sex   Age   Height (in)   Weight (lbs)
0  Alex         "M"    41            74            170
1  Bert         "M"    42            68            166
2  Carl         "M"    32            70            155
3  Dave         "M"    39            72            167
4  Elly         "F"    30            66            124

In [38]:
d.head(7)

   Name         Sex   Age   Height (in)   Weight (lbs)
0  Alex         "M"    41            74            170
1  Bert         "M"    42            68            166
2  Carl         "M"    32            70            155
3  Dave         "M"    39            72            167
4  Elly         "F"    30            66            124
5  Fran         "F"    33            66            115
6  Gwen         "F"    26            64            121

In [39]:
d.tail()

    Name         Sex   Age   Height (in)   Weight (lbs)
13  Neil         "M"    36            75            160
14  Omar         "M"    38            70            145
15  Page         "F"    31            67            135
16  Quin         "M"    29            71            176
17  Ruth         "F"    28            65            131

In [40]:
d.tail(3)

    Name         Sex   Age   Height (in)   Weight (lbs)
15  Page         "F"    31            67            135
16  Quin         "M"    29            71            176
17  Ruth         "F"    28            65            131

In [41]:
d.describe()

             Age   Height (in)   Weight (lbs)
count  18.000000     18.000000      18.000000
mean   34.666667     69.055556     146.722222
std     7.577055      3.522570      22.540958
min    23.000000     62.000000      98.000000
25%    30.000000     66.250000     132.000000
50%    32.500000     69.500000     150.000000
75%    38.750000     71.750000     165.250000
max    53.000000     75.000000     176.000000

In [42]:
d.columns[0:3]

Index(['Name', '     Sex', ' Age'], dtype='object')

In [43]:
d.columns

Index(['Name', '     Sex', ' Age', ' Height (in)', ' Weight (lbs)'], dtype='object')

In [44]:
d.iloc[7:10,0:3]

   Name         Sex   Age
7  Hank         "M"    30
8  Ivan         "M"    53
9  Jake         "M"    32

In [45]:
f=d.Name
f

0     Alex
1     Bert
2     Carl
3     Dave
4     Elly
5     Fran
6     Gwen
7     Hank
8     Ivan
9     Jake
10    Kate
11    Luke
12    Myra
13    Neil
14    Omar
15    Page
16    Quin
17    Ruth
Name: Name, dtype: object